/****************************************************
*版权所有：深圳永胜宏基医疗器械有限公司
*文件名：lang.c
*功能说明：创建系统任务等
*作者：软件组
*生成日期：2017/02/27
*****************************************************/

/*****************************************************
*头文件包含
******************************************************/
//#include "main.h"
#include "app.h"
//#include "includes.h"
#include "lang.h"
#include "lang_english.h"
#include "lang_chinese.h"
//#include "config_module.h"

/******************************************************
*局部变量定义
******************************************************/

/******************************************************
*全局变量定义
******************************************************/
CONFIG_TYPE cur_config; 
CONFIG_SAVE_TYPE config_save_info;

LANG_STR_TYPE* lang_array;

extern CONFIG_TYPE cur_config; 
/******************************************************
*内部函数声明
******************************************************/


/******************************************************
*其他定义
******************************************************/

/******************************************************
*内部函数定义
******************************************************/

/***************************************************
*函数名称：init_lang
*功能描述：初始化语言
*输入参数：无
*输出参数：无
*返回值：无
****************************************************/
void init_lang(void)
{
	lang_array = english_array;
	cur_config.lang_type = ENGLISH;
}

/***************************************************
*函数名称：modify_lang
*功能描述：初始化语言
*输入参数：无
*输出参数：无
*返回值：无
****************************************************/
void modify_lang(u32 lang)
{
	switch(lang)
	{
		case ENGLISH:
			lang_array = english_array;
			cur_config.lang_type = ENGLISH;
			break;
		case CHINESE:
			lang_array = chinese_array;
			cur_config.lang_type = CHINESE;
			break;
		default:
			break;
	}
}
 
	  
