/****************************************************
*版权所有：深圳永胜宏基医疗器械有限公司
*文件名：lang.c
*功能说明：创建系统任务等
*作者：软件组
*生成日期：2017/02/27
*****************************************************/

/*****************************************************
*头文件包含
******************************************************/
//#include "main.h"
#include "app.h"
//#include "includes.h"
#include "lang.h"
#include "lang_chinese.h"

/******************************************************
*局部变量定义
******************************************************/

/******************************************************
*全局变量定义
******************************************************/
LANG_STR_TYPE chinese_array[MAX_STR_CNT] = {
	CHINESE, 0, "设置", //设置
	CHINESE, 0, "流量",//流量
	CHINESE, 10, "时间设置", //时间设置
	CHINESE, 0,"时间", //时间
	CHINESE, 0,"日期", //日期
	CHINESE, 0,"返回", //返回
	CHINESE, 0, "英文",//英文
	CHINESE, 0, "中文",//中文
	CHINESE, 0, "模式",//模式
	CHINESE, 0, "更多",//更多
	CHINESE, 38, "语言", //语言
	CHINESE, 0, "信息", //信息
	CHINESE, 15, "高压",//气体
	CHINESE, 20, "模式",//混合
	CHINESE, -5, "低压",//氧气
	CHINESE, 0, "无",//无
	CHINESE, 20, "模式",//仅有
	CHINESE, 0, "电子空氧混合器",//lectronic Gas Blender
	CHINESE, 0, "序列号",//sn
	CHINESE, 0, "软件版本",//软件版本
	CHINESE, 0, "硬件版本",//硬件版本
	CHINESE, 0, "型号",//型号
	CHINESE, 24, "报警回顾", // 报警回顾
	CHINESE, 0, "报警",// 报警
	CHINESE, 0, "流量不足",//
	CHINESE, 0, "请检查气源！",
	CHINESE, 0, "系统错误",
	CHINESE, 0, "低氧浓度",
	CHINESE, 0, "高氧浓度",
	CHINESE, 0, "电池电量低",
	CHINESE, 0, "流量超限，请更改氧浓度设置！",
	CHINESE, 0, "关机之前请停止运行！",
	CHINESE, 0, "系统关机！",
	CHINESE, 0, "无报警！",
	CHINESE, 0, "请重新设置时间！",
	CHINESE, 0, "电池电量低！",
	CHINESE, 20, "警告",
	CHINESE, 10, "请打开环境空气盖子！",
	CHINESE, 0, "",
	CHINESE, 0, "是",
	CHINESE, 0, "否",
	CHINESE, 0, "流量传感器错误！",
	CHINESE, 0, "流量传感器错误！",
	CHINESE, 0, "流量传感器错误！",
	CHINESE, 0, "流量传感器错误！",
	CHINESE, 0, "存储器",//EEPROM
	CHINESE, 0, "错误",//EEPROM
	CHINESE, 30, "报警信息不能保存，",
	CHINESE, 7, "是否继续？",
	CHINESE, 0, "按下",
	CHINESE, 0, "秒退出运行！"
};
/******************************************************
*内部函数声明
******************************************************/



/******************************************************
*其他定义
******************************************************/

/******************************************************
*内部函数定义
******************************************************/

/***************************************************
*函数名称：start_task
*功能描述：初始化系统软硬件、创建系统任务
*输入参数：无
*输出参数：无
*返回值：无
****************************************************/


 
	  